In [14]:
import pandas as pd

In [15]:
import matplotlib.pyplot as plt

In [16]:
data = pd.read_csv("C:/Users/elcot/Desktop/Fraud_check.csv")

In [17]:
data.head()

  Undergrad   Marital  Income  Experience Urban
0        NO    Single   68833          10   YES
1       YES  Divorced   33700          18   YES
2        NO   Married   36925          30   YES
3       YES    Single   50190          15   YES
4        NO   Married   81002          28    NO

In [18]:
data['Income']=data['Income'].apply(lambda x:"1" if x>=30000 else "0")

In [19]:
data.head()

  Undergrad   Marital Income  Experience Urban
0        NO    Single      1          10   YES
1       YES  Divorced      1          18   YES
2        NO   Married      1          30   YES
3       YES    Single      1          15   YES
4        NO   Married      1          28    NO

In [20]:
inputs=data.drop('Income',axis='columns')

In [21]:
target=data['Income']

In [22]:
target.head()

0    1
1    1
2    1
3    1
4    1
Name: Income, dtype: object

In [23]:
inputs.head()

  Undergrad   Marital  Experience Urban
0        NO    Single          10   YES
1       YES  Divorced          18   YES
2        NO   Married          30   YES
3       YES    Single          15   YES
4        NO   Married          28    NO

In [24]:
target_1=data['Income']

In [25]:
target_1.head()

0    1
1    1
2    1
3    1
4    1
Name: Income, dtype: object

In [26]:
from sklearn.preprocessing import LabelEncoder

In [27]:
le_Undergrad = LabelEncoder()
le_Marital = LabelEncoder()
le_Urban = LabelEncoder()

In [28]:
inputs['Undergrad_n']=le_Undergrad.fit_transform(inputs['Undergrad'])
inputs['Marital_n']=le_Undergrad.fit_transform(inputs['Marital'])
inputs['Urban_n']=le_Undergrad.fit_transform(inputs['Urban'])

In [29]:
inputs.head()

  Undergrad   Marital  Experience Urban  Undergrad_n  Marital_n  Urban_n
0        NO    Single          10   YES            0          2        1
1       YES  Divorced          18   YES            1          0        1
2        NO   Married          30   YES            0          1        1
3       YES    Single          15   YES            1          2        1
4        NO   Married          28    NO            0          1        0

In [30]:
inputs_n=inputs.drop(['Undergrad','Marital','Urban'],axis='columns')

In [31]:
inputs_n.head()

   Experience  Undergrad_n  Marital_n  Urban_n
0          10            0          2        1
1          18            1          0        1
2          30            0          1        1
3          15            1          2        1
4          28            0          1        0

In [32]:
from sklearn.tree import DecisionTreeClassifier

In [33]:
from sklearn.model_selection import train_test_split

In [34]:
X_train, X_test, y_train, y_test = train_test_split(inputs_n, target, test_size=0.3, random_state=1)

In [35]:
model = DecisionTreeClassifier(criterion="entropy", max_depth=3)

In [36]:
model.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='entropy', max_depth=3,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [37]:
y_pred = model.predict(X_test)

In [38]:
count_misclassified = (y_test != y_pred).sum()

In [39]:
print('Misclassified samples: {}'.format(count_misclassified))

Misclassified samples: 36

In [40]:
from sklearn import tree, metrics

In [41]:
accuracy = metrics.accuracy_score(y_test, y_pred)

In [42]:
print('Accuracy: {:.2f}'.format(accuracy))

Accuracy: 0.80